In [75]:
import pandas as pd
df= pd.read_excel('UNIT_1.xlsx')

In [76]:
df

   Employee_ID     Name   Department Joining_Date     Salary
0      EMP105    grace           it    2021/07/25      51330
1      EMP101       ian          it     22/May/20      43892
2      EMP107      dave      finance   11-11-2018  60504 INR
3      EMP119     JULIA      finance   21-10-2016  54310 INR
4      EMP105      dave           Hr   12-11-2020   79785 Rs
5      EMP108     Bob    Operations    2019/05/10      65630
6      EMP101   charLie    MARKETING    13/Jun/15   39025 Rs
7      EMP100     alice           Hr   24-10-2017      55813
8      EMP115   charLie          it    25-11-2017  76191 INR
9      EMP106      dave           Hr   19-05-2016  57566 INR
10     EMP113     JULIA      finance    10/Apr/20  75798 INR
11     EMP105      dave    MARKETING   04-09-2016   49853 Rs
12     EMP111     frank    MARKETING   2018/06/13      47185
13     EMP118     JULIA           Hr   03-11-2017      63997
14     EMP114     frank       sales    2017/08/09      54424
15     EMP112       ian      finance   2022/12/25   73618 Rs
16     EMP116     Bob      MARKETING   02-10-2017      35972
17     EMP103     Bob         sales    2016/07/09   67158 Rs
18     EMP110     frank      finance    24/Jan/16      34106
19     EMP113     JULIA  Operations     17/Oct/18   25904 Rs
20     EMP112     JULIA    MARKETING   16-01-2017   51884 Rs
21     EMP104      dave    MARKETING   02-10-2019      41208
22     EMP104    grace        sales    07-08-2022   25914 Rs
23     EMP106       ian           Hr   15-09-2020   67064 Rs
24     EMP113   hannah       finance   2018/10/11   62618 Rs
25     EMP119       EVA           Hr    07/Mar/18      57966
26     EMP100       ian          it    07-06-2016  33112 INR
27     EMP116   charLie    MARKETING    31/May/20      44333
28     EMP103     Bob    Operations     01/Jul/17      38881
29     EMP113       ian    MARKETING   28-02-2019   43333 Rs
30     EMP107   charLie    MARKETING    29/Jan/16      27475
31     EMP118     JULIA           Hr   2019/03/27      36840
32     EMP110    grace        sales    24-04-2016   35093 Rs
33     EMP111     JULIA          it     28/Oct/20      70255
34     EMP112   hannah        sales    2015/08/20      79436
35     EMP113   charLie       sales    26-10-2016      61158
36     EMP100   hannah     MARKETING    01/Apr/19      65856
37     EMP107     frank          it    2018/04/14      34758
38     EMP120     JULIA  Operations     14/Aug/19      26346
39     EMP110   charLie       sales    09-01-2017      49592
40     EMP110       ian           Hr   29-08-2015      34494
41     EMP113     frank           Hr   03-02-2022      63987
42     EMP114    grace   Operations     25/Apr/21      74092
43     EMP105       EVA           Hr    24/May/18   75496 Rs
44     EMP108     Bob      MARKETING    27/Jun/17   28601 Rs
45     EMP114   hannah   Operations    2018/02/17   57278 Rs
46     EMP114     frank       sales    2021/12/12      78658
47     EMP108      dave           Hr   2015/11/13  62977 INR
48     EMP113    grace     MARKETING   2019/12/16  56099 INR
49     EMP106     alice      finance   15-07-2015   70283 Rs

In [17]:
df.head(10)

  Employee_ID     Name   Department Joining_Date     Salary
0     EMP105    grace           it    2021/07/25      51330
1     EMP101       ian          it     22/May/20      43892
2     EMP107      dave      finance   11-11-2018  60504 INR
3     EMP119     JULIA      finance   21-10-2016  54310 INR
4     EMP105      dave           Hr   12-11-2020   79785 Rs
5     EMP108     Bob    Operations    2019/05/10      65630
6     EMP101   charLie    MARKETING    13/Jun/15   39025 Rs
7     EMP100     alice           Hr   24-10-2017      55813
8     EMP115   charLie          it    25-11-2017  76191 INR
9     EMP106      dave           Hr   19-05-2016  57566 INR

In [5]:
df.tail()

   Employee_ID     Name   Department Joining_Date     Salary
45     EMP114   hannah   Operations    2018/02/17   57278 Rs
46     EMP114     frank       sales    2021/12/12      78658
47     EMP108      dave           Hr   2015/11/13  62977 INR
48     EMP113    grace     MARKETING   2019/12/16  56099 INR
49     EMP106     alice      finance   15-07-2015   70283 Rs

In [6]:
df.describe()

       Employee_ID   Name Department Joining_Date Salary
count           50     50         50           50     50
unique          18     10          6           50     50
top        EMP113   JULIA  MARKETING   2021/07/25  51330
freq             7      8         12            1      1

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Employee_ID   50 non-null     object
 1   Name          50 non-null     object
 2   Department    50 non-null     object
 3   Joining_Date  50 non-null     object
 4   Salary        50 non-null     object
dtypes: object(5)
memory usage: 2.1+ KB

In [8]:
df["Employee_ID"]

0      EMP105
1      EMP101
2      EMP107
3      EMP119
4      EMP105
5      EMP108
6      EMP101
7      EMP100
8      EMP115
9      EMP106
10     EMP113
11     EMP105
12     EMP111
13     EMP118
14     EMP114
15     EMP112
16     EMP116
17     EMP103
18     EMP110
19     EMP113
20     EMP112
21     EMP104
22     EMP104
23     EMP106
24     EMP113
25     EMP119
26     EMP100
27     EMP116
28     EMP103
29     EMP113
30     EMP107
31     EMP118
32     EMP110
33     EMP111
34     EMP112
35     EMP113
36     EMP100
37     EMP107
38     EMP120
39     EMP110
40     EMP110
41     EMP113
42     EMP114
43     EMP105
44     EMP108
45     EMP114
46     EMP114
47     EMP108
48     EMP113
49     EMP106
Name: Employee_ID, dtype: object

In [16]:
df.columns

Index(['Employee_ID', 'Name', 'Department', 'Joining_Date', 'Salary'], dtype='object')

In [31]:
#fixing name column
df["Name"].str.strip().str.upper()

0       GRACE
1         IAN
2        DAVE
3       JULIA
4        DAVE
5         BOB
6     CHARLIE
7       ALICE
8     CHARLIE
9        DAVE
10      JULIA
11       DAVE
12      FRANK
13      JULIA
14      FRANK
15        IAN
16        BOB
17        BOB
18      FRANK
19      JULIA
20      JULIA
21       DAVE
22      GRACE
23        IAN
24     HANNAH
25        EVA
26        IAN
27    CHARLIE
28        BOB
29        IAN
30    CHARLIE
31      JULIA
32      GRACE
33      JULIA
34     HANNAH
35    CHARLIE
36     HANNAH
37      FRANK
38      JULIA
39    CHARLIE
40        IAN
41      FRANK
42      GRACE
43        EVA
44        BOB
45     HANNAH
46      FRANK
47       DAVE
48      GRACE
49      ALICE
Name: Name, dtype: object

In [77]:
df["Name"]=df["Name"].str.strip().str.upper()
df.sample(4)

   Employee_ID     Name Department Joining_Date     Salary
39     EMP110   CHARLIE     sales    09-01-2017      49592
25     EMP119       EVA         Hr    07/Mar/18      57966
10     EMP113     JULIA    finance    10/Apr/20  75798 INR
33     EMP111     JULIA        it     28/Oct/20      70255

In [88]:
df["Department"]=df["Department"].str.strip().str.upper()
df.sample(4)

   Employee_ID     Name Department Joining_Date  Salary
48     EMP113     GRACE  MARKETING   2019/12/16   56099
27     EMP116   CHARLIE  MARKETING    31/May/20   44333
10     EMP113     JULIA    FINANCE    10/Apr/20   75798
34     EMP112    HANNAH      SALES   2015/08/20   79436

In [39]:
#df.Salary.head(2)
df["Salary"].head(2)

0    51330
1    43892
Name: Salary, dtype: object

In [42]:
df["Salary"].str.len()

0     5
1     5
2     9
3     9
4     8
5     5
6     8
7     5
8     9
9     9
10    9
11    8
12    5
13    5
14    5
15    8
16    5
17    8
18    5
19    8
20    8
21    5
22    8
23    8
24    8
25    5
26    9
27    5
28    5
29    8
30    5
31    5
32    8
33    5
34    5
35    5
36    5
37    5
38    5
39    5
40    5
41    5
42    5
43    8
44    8
45    8
46    5
47    9
48    9
49    8
Name: Salary, dtype: int64

In [47]:
v = df["Salary"].unique()[2]

In [48]:
type(v)

str

In [78]:
df["Salary"] = df["Salary"].str.replace(" INR","")

In [79]:
df["Salary"] =df["Salary"].str.replace(" Rs","")

In [80]:
#df["Salary"] =df["Salary"].str.replace(" Rs","").str.replace(" INR", "")
df

   Employee_ID     Name   Department Joining_Date Salary
0      EMP105     GRACE          it    2021/07/25  51330
1      EMP101       IAN          it     22/May/20  43892
2      EMP107      DAVE      finance   11-11-2018  60504
3      EMP119     JULIA      finance   21-10-2016  54310
4      EMP105      DAVE           Hr   12-11-2020  79785
5      EMP108       BOB  Operations    2019/05/10  65630
6      EMP101   CHARLIE    MARKETING    13/Jun/15  39025
7      EMP100     ALICE           Hr   24-10-2017  55813
8      EMP115   CHARLIE          it    25-11-2017  76191
9      EMP106      DAVE           Hr   19-05-2016  57566
10     EMP113     JULIA      finance    10/Apr/20  75798
11     EMP105      DAVE    MARKETING   04-09-2016  49853
12     EMP111     FRANK    MARKETING   2018/06/13  47185
13     EMP118     JULIA           Hr   03-11-2017  63997
14     EMP114     FRANK       sales    2017/08/09  54424
15     EMP112       IAN      finance   2022/12/25  73618
16     EMP116       BOB    MARKETING   02-10-2017  35972
17     EMP103       BOB       sales    2016/07/09  67158
18     EMP110     FRANK      finance    24/Jan/16  34106
19     EMP113     JULIA  Operations     17/Oct/18  25904
20     EMP112     JULIA    MARKETING   16-01-2017  51884
21     EMP104      DAVE    MARKETING   02-10-2019  41208
22     EMP104     GRACE       sales    07-08-2022  25914
23     EMP106       IAN           Hr   15-09-2020  67064
24     EMP113    HANNAH      finance   2018/10/11  62618
25     EMP119       EVA           Hr    07/Mar/18  57966
26     EMP100       IAN          it    07-06-2016  33112
27     EMP116   CHARLIE    MARKETING    31/May/20  44333
28     EMP103       BOB  Operations     01/Jul/17  38881
29     EMP113       IAN    MARKETING   28-02-2019  43333
30     EMP107   CHARLIE    MARKETING    29/Jan/16  27475
31     EMP118     JULIA           Hr   2019/03/27  36840
32     EMP110     GRACE       sales    24-04-2016  35093
33     EMP111     JULIA          it     28/Oct/20  70255
34     EMP112    HANNAH       sales    2015/08/20  79436
35     EMP113   CHARLIE       sales    26-10-2016  61158
36     EMP100    HANNAH    MARKETING    01/Apr/19  65856
37     EMP107     FRANK          it    2018/04/14  34758
38     EMP120     JULIA  Operations     14/Aug/19  26346
39     EMP110   CHARLIE       sales    09-01-2017  49592
40     EMP110       IAN           Hr   29-08-2015  34494
41     EMP113     FRANK           Hr   03-02-2022  63987
42     EMP114     GRACE  Operations     25/Apr/21  74092
43     EMP105       EVA           Hr    24/May/18  75496
44     EMP108       BOB    MARKETING    27/Jun/17  28601
45     EMP114    HANNAH  Operations    2018/02/17  57278
46     EMP114     FRANK       sales    2021/12/12  78658
47     EMP108      DAVE           Hr   2015/11/13  62977
48     EMP113     GRACE    MARKETING   2019/12/16  56099
49     EMP106     ALICE      finance   15-07-2015  70283

In [ ]:
#df.drop(Columns="column name", inplace =True)
#df= df.drop(Columns="column name")

In [82]:
df["Salary"]=df["Salary"].astype(int)

In [84]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Employee_ID   50 non-null     object
 1   Name          50 non-null     object
 2   Department    50 non-null     object
 3   Joining_Date  50 non-null     object
 4   Salary        50 non-null     int64
dtypes: int64(1), object(4)
memory usage: 2.1+ KB

In [90]:
df["Department"].unique()

array(['IT', 'FINANCE', 'HR', 'OPERATIONS', 'MARKETING', 'SALES'],
      dtype=object)

In [89]:
df["Department"].value_counts()

Department
MARKETING     12
HR            11
SALES          8
FINANCE        7
IT             6
OPERATIONS     6
Name: count, dtype: int64

In [91]:
it_df=df[df["Department"]=="IT"]
it_df

   Employee_ID     Name Department Joining_Date  Salary
0      EMP105     GRACE         IT   2021/07/25   51330
1      EMP101       IAN         IT    22/May/20   43892
8      EMP115   CHARLIE         IT   25-11-2017   76191
26     EMP100       IAN         IT   07-06-2016   33112
33     EMP111     JULIA         IT    28/Oct/20   70255
37     EMP107     FRANK         IT   2018/04/14   34758

In [92]:
df["Name"].str.upper()

0       GRACE
1         IAN
2        DAVE
3       JULIA
4        DAVE
5         BOB
6     CHARLIE
7       ALICE
8     CHARLIE
9        DAVE
10      JULIA
11       DAVE
12      FRANK
13      JULIA
14      FRANK
15        IAN
16        BOB
17        BOB
18      FRANK
19      JULIA
20      JULIA
21       DAVE
22      GRACE
23        IAN
24     HANNAH
25        EVA
26        IAN
27    CHARLIE
28        BOB
29        IAN
30    CHARLIE
31      JULIA
32      GRACE
33      JULIA
34     HANNAH
35    CHARLIE
36     HANNAH
37      FRANK
38      JULIA
39    CHARLIE
40        IAN
41      FRANK
42      GRACE
43        EVA
44        BOB
45     HANNAH
46      FRANK
47       DAVE
48      GRACE
49      ALICE
Name: Name, dtype: object

In [93]:
df["Name"].str.lower()

0       grace
1         ian
2        dave
3       julia
4        dave
5         bob
6     charlie
7       alice
8     charlie
9        dave
10      julia
11       dave
12      frank
13      julia
14      frank
15        ian
16        bob
17        bob
18      frank
19      julia
20      julia
21       dave
22      grace
23        ian
24     hannah
25        eva
26        ian
27    charlie
28        bob
29        ian
30    charlie
31      julia
32      grace
33      julia
34     hannah
35    charlie
36     hannah
37      frank
38      julia
39    charlie
40        ian
41      frank
42      grace
43        eva
44        bob
45     hannah
46      frank
47       dave
48      grace
49      alice
Name: Name, dtype: object

In [94]:
df["Name"].str.title()

0       Grace
1         Ian
2        Dave
3       Julia
4        Dave
5         Bob
6     Charlie
7       Alice
8     Charlie
9        Dave
10      Julia
11       Dave
12      Frank
13      Julia
14      Frank
15        Ian
16        Bob
17        Bob
18      Frank
19      Julia
20      Julia
21       Dave
22      Grace
23        Ian
24     Hannah
25        Eva
26        Ian
27    Charlie
28        Bob
29        Ian
30    Charlie
31      Julia
32      Grace
33      Julia
34     Hannah
35    Charlie
36     Hannah
37      Frank
38      Julia
39    Charlie
40        Ian
41      Frank
42      Grace
43        Eva
44        Bob
45     Hannah
46      Frank
47       Dave
48      Grace
49      Alice
Name: Name, dtype: object

In [96]:
df["Name"].str.capitalize()

0       Grace
1         Ian
2        Dave
3       Julia
4        Dave
5         Bob
6     Charlie
7       Alice
8     Charlie
9        Dave
10      Julia
11       Dave
12      Frank
13      Julia
14      Frank
15        Ian
16        Bob
17        Bob
18      Frank
19      Julia
20      Julia
21       Dave
22      Grace
23        Ian
24     Hannah
25        Eva
26        Ian
27    Charlie
28        Bob
29        Ian
30    Charlie
31      Julia
32      Grace
33      Julia
34     Hannah
35    Charlie
36     Hannah
37      Frank
38      Julia
39    Charlie
40        Ian
41      Frank
42      Grace
43        Eva
44        Bob
45     Hannah
46      Frank
47       Dave
48      Grace
49      Alice
Name: Name, dtype: object

In [97]:
df["Name"].str.strip()

0       GRACE
1         IAN
2        DAVE
3       JULIA
4        DAVE
5         BOB
6     CHARLIE
7       ALICE
8     CHARLIE
9        DAVE
10      JULIA
11       DAVE
12      FRANK
13      JULIA
14      FRANK
15        IAN
16        BOB
17        BOB
18      FRANK
19      JULIA
20      JULIA
21       DAVE
22      GRACE
23        IAN
24     HANNAH
25        EVA
26        IAN
27    CHARLIE
28        BOB
29        IAN
30    CHARLIE
31      JULIA
32      GRACE
33      JULIA
34     HANNAH
35    CHARLIE
36     HANNAH
37      FRANK
38      JULIA
39    CHARLIE
40        IAN
41      FRANK
42      GRACE
43        EVA
44        BOB
45     HANNAH
46      FRANK
47       DAVE
48      GRACE
49      ALICE
Name: Name, dtype: object

In [98]:
df["Name"].str.lstrip()

0       GRACE
1         IAN
2        DAVE
3       JULIA
4        DAVE
5         BOB
6     CHARLIE
7       ALICE
8     CHARLIE
9        DAVE
10      JULIA
11       DAVE
12      FRANK
13      JULIA
14      FRANK
15        IAN
16        BOB
17        BOB
18      FRANK
19      JULIA
20      JULIA
21       DAVE
22      GRACE
23        IAN
24     HANNAH
25        EVA
26        IAN
27    CHARLIE
28        BOB
29        IAN
30    CHARLIE
31      JULIA
32      GRACE
33      JULIA
34     HANNAH
35    CHARLIE
36     HANNAH
37      FRANK
38      JULIA
39    CHARLIE
40        IAN
41      FRANK
42      GRACE
43        EVA
44        BOB
45     HANNAH
46      FRANK
47       DAVE
48      GRACE
49      ALICE
Name: Name, dtype: object

In [99]:
df["Name"].str.rstrip()

0       GRACE
1         IAN
2        DAVE
3       JULIA
4        DAVE
5         BOB
6     CHARLIE
7       ALICE
8     CHARLIE
9        DAVE
10      JULIA
11       DAVE
12      FRANK
13      JULIA
14      FRANK
15        IAN
16        BOB
17        BOB
18      FRANK
19      JULIA
20      JULIA
21       DAVE
22      GRACE
23        IAN
24     HANNAH
25        EVA
26        IAN
27    CHARLIE
28        BOB
29        IAN
30    CHARLIE
31      JULIA
32      GRACE
33      JULIA
34     HANNAH
35    CHARLIE
36     HANNAH
37      FRANK
38      JULIA
39    CHARLIE
40        IAN
41      FRANK
42      GRACE
43        EVA
44        BOB
45     HANNAH
46      FRANK
47       DAVE
48      GRACE
49      ALICE
Name: Name, dtype: object

In [100]:
df["Name"].str.len()

0     5
1     3
2     4
3     5
4     4
5     3
6     7
7     5
8     7
9     4
10    5
11    4
12    5
13    5
14    5
15    3
16    3
17    3
18    5
19    5
20    5
21    4
22    5
23    3
24    6
25    3
26    3
27    7
28    3
29    3
30    7
31    5
32    5
33    5
34    6
35    7
36    6
37    5
38    5
39    7
40    3
41    5
42    5
43    3
44    3
45    6
46    5
47    4
48    5
49    5
Name: Name, dtype: int64

In [103]:
df["Name"].str.contains("ritu")

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
Name: Name, dtype: bool

In [107]:
df["Name"].str.startswith("A")

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7      True
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49     True
Name: Name, dtype: bool

In [110]:
df["Name"].str.endswith("A")

0     False
1     False
2     False
3      True
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11    False
12    False
13     True
14    False
15    False
16    False
17    False
18    False
19     True
20     True
21    False
22    False
23    False
24    False
25     True
26    False
27    False
28    False
29    False
30    False
31     True
32    False
33     True
34    False
35    False
36    False
37    False
38     True
39    False
40    False
41    False
42    False
43     True
44    False
45    False
46    False
47    False
48    False
49    False
Name: Name, dtype: bool

In [111]:
df["Name"].str.replace("BOB","BHARTI")

0       GRACE
1         IAN
2        DAVE
3       JULIA
4        DAVE
5      BHARTI
6     CHARLIE
7       ALICE
8     CHARLIE
9        DAVE
10      JULIA
11       DAVE
12      FRANK
13      JULIA
14      FRANK
15        IAN
16     BHARTI
17     BHARTI
18      FRANK
19      JULIA
20      JULIA
21       DAVE
22      GRACE
23        IAN
24     HANNAH
25        EVA
26        IAN
27    CHARLIE
28     BHARTI
29        IAN
30    CHARLIE
31      JULIA
32      GRACE
33      JULIA
34     HANNAH
35    CHARLIE
36     HANNAH
37      FRANK
38      JULIA
39    CHARLIE
40        IAN
41      FRANK
42      GRACE
43        EVA
44     BHARTI
45     HANNAH
46      FRANK
47       DAVE
48      GRACE
49      ALICE
Name: Name, dtype: object

In [112]:
df["Name"].str.split("")

0           [, G, R, A, C, E, ]
1                 [, I, A, N, ]
2              [, D, A, V, E, ]
3           [, J, U, L, I, A, ]
4              [, D, A, V, E, ]
5                 [, B, O, B, ]
6     [, C, H, A, R, L, I, E, ]
7           [, A, L, I, C, E, ]
8     [, C, H, A, R, L, I, E, ]
9              [, D, A, V, E, ]
10          [, J, U, L, I, A, ]
11             [, D, A, V, E, ]
12          [, F, R, A, N, K, ]
13          [, J, U, L, I, A, ]
14          [, F, R, A, N, K, ]
15                [, I, A, N, ]
16                [, B, O, B, ]
17                [, B, O, B, ]
18          [, F, R, A, N, K, ]
19          [, J, U, L, I, A, ]
20          [, J, U, L, I, A, ]
21             [, D, A, V, E, ]
22          [, G, R, A, C, E, ]
23                [, I, A, N, ]
24       [, H, A, N, N, A, H, ]
25                [, E, V, A, ]
26                [, I, A, N, ]
27    [, C, H, A, R, L, I, E, ]
28                [, B, O, B, ]
29                [, I, A, N, ]
30    [, C, H, A, R, L, I, E, ]
31          [, J, U, L, I, A, ]
32          [, G, R, A, C, E, ]
33          [, J, U, L, I, A, ]
34       [, H, A, N, N, A, H, ]
35    [, C, H, A, R, L, I, E, ]
36       [, H, A, N, N, A, H, ]
37          [, F, R, A, N, K, ]
38          [, J, U, L, I, A, ]
39    [, C, H, A, R, L, I, E, ]
40                [, I, A, N, ]
41          [, F, R, A, N, K, ]
42          [, G, R, A, C, E, ]
43                [, E, V, A, ]
44                [, B, O, B, ]
45       [, H, A, N, N, A, H, ]
46          [, F, R, A, N, K, ]
47             [, D, A, V, E, ]
48          [, G, R, A, C, E, ]
49          [, A, L, I, C, E, ]
Name: Name, dtype: object

In [114]:
df["Name"].str.count("I")

0     0
1     1
2     0
3     1
4     0
5     0
6     1
7     1
8     1
9     0
10    1
11    0
12    0
13    1
14    0
15    1
16    0
17    0
18    0
19    1
20    1
21    0
22    0
23    1
24    0
25    0
26    1
27    1
28    0
29    1
30    1
31    1
32    0
33    1
34    0
35    1
36    0
37    0
38    1
39    1
40    1
41    0
42    0
43    0
44    0
45    0
46    0
47    0
48    0
49    1
Name: Name, dtype: int64

In [115]:
df["Name"].str.isalpha()

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
14    True
15    True
16    True
17    True
18    True
19    True
20    True
21    True
22    True
23    True
24    True
25    True
26    True
27    True
28    True
29    True
30    True
31    True
32    True
33    True
34    True
35    True
36    True
37    True
38    True
39    True
40    True
41    True
42    True
43    True
44    True
45    True
46    True
47    True
48    True
49    True
Name: Name, dtype: bool

In [116]:
df["Name"].str.isdigit()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
Name: Name, dtype: bool

In [118]:
df["Name"].str.isalnum()

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
14    True
15    True
16    True
17    True
18    True
19    True
20    True
21    True
22    True
23    True
24    True
25    True
26    True
27    True
28    True
29    True
30    True
31    True
32    True
33    True
34    True
35    True
36    True
37    True
38    True
39    True
40    True
41    True
42    True
43    True
44    True
45    True
46    True
47    True
48    True
49    True
Name: Name, dtype: bool